app/controllers/courses_controller.rb

    def index
        courses = Course.all
---
SELECT "courses".* FROM "courses"

    def show
        course = Course.find(params[:id])
        course_id = course.id
        course_content = Content.find_by(course_id: course_id)
        author = Course.find_by(params[:author])
        course_enrollments = course.enrollments
        number_of_enrollment = Enrollment.where(course_id: course_id).count
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 89], ["LIMIT", 1]]
SELECT COUNT(*) FROM "enrollments" WHERE "enrollments"."course_id" = $1  [["course_id", 154]]

    def create
        course = Course.new(course_params)
        course.user = current_user
        course.author = current_user.name

        if course.save
---
INSERT INTO "courses" ("title", "description", "price", "user_id", "created_at", "updated_at", "author") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"