app/controllers/enrollments_controller.rb

SELECT  "enrollments".* FROM "enrollments" LIMIT $1  [["LIMIT", 1]]
---
    def index
        enrollments = Enrollment.all

SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def show
        enrollment = Enrollment.find(params[:id])

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 156], ["LIMIT", 1]]
SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = $1 LIMIT $2  [["user_id", 56], ["LIMIT", 1]]
INSERT INTO "enrollments" ("course_id", "user_id", "course_title", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["course_id", 157], ["user_id", 55], ["course_title", "Lorem Ipsum"], ["username", "aakash"], ["created_at", "2019-02-24 17:56:27.676556"], ["updated_at", "2019-02-24 17:56:27.676556"]]
---
    def create
        enrollment = Enrollment.new(enrollment_params)
        course_id = enrollment.course_id
        course = Course.find(course_id)
        user = current_user
        enrollment.course_title = course.title
        enrollment.username = user.username
        enrollment.user_id = user.id

        if Enrollment.find_by(enrollment_params).where(user_id: user.id) #this condition needs to be fixed
            render json: {message: "You have already enrolled!"}
        else
            if enrollment.save