app/controllers/users_controller.rb

    def create
        user = User.create!(user_params)
---
INSERT INTO "users" ("username", "password_digest", "email", "name", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def profile
        user = User.find_by_auth_token!(request.headers[:token])
---
SELECT  "users".* FROM "users" WHERE "users"."auth_token" = $1 LIMIT $2  [["auth_token", "eEjMmHDvGawUyYV79McF2doS"], ["LIMIT", 1]]