app/controllers/users_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = $1  [["user_id", 55]]
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = $1  [["user_id", 55]]
---
    def update
        user = User.find_by(id: current_user.id)

        if user.update_attributes(user_params)
            courses = Course.where(user_id: user.id)
            courses.update_all(author: user.name)

            user_courses = user.courses

            enrollment = Enrollment.where(user_id: user.id)